In [9]:
import pandas as pd 
data_ls = [10,20,'Ronnakon']
data_tp = (10,20,'Ronnakon')
data_age = (10,20,33,44,53)
df1 = pd.DataFrame(data_ls)
df1

          0
0        10
1        20
2  Ronnakon

In [10]:
df2 = pd.DataFrame(data_tp)
df2

          0
0        10
1        20
2  Ronnakon

In [14]:
cols = ["age"]
df3 = pd.DataFrame(data_age,columns=cols)
df3

   age
0   10
1   20
2   33
3   44
4   53